Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортПорученийФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ИмпортПорученийФонда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФайлов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиВСистему</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортПорученийФонда/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИмяКаталога) Тогда
		//Объект.ИмяКаталога = "\\g1\shares\UK\RNTrust\РТраст-филиал\ОТДЕЛ_ВНУТРЕННЕГО_УЧЕТА\ВВОДЫ_ВЫВОДЫ в формате XML";
		Объект.ИмяКаталога = "\\g1\shares\UK\Client\РегионЭсМ\ОТДЕЛ_ ВНУТРЕННЕГО_ УЧЕТА\ВВОДЫ_ВЫВОДЫ в формате XML";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаФайлов) Тогда
		Объект.ДатаФайлов = ТекущаяДатаСеанса();
		Объект.ДатаЗагрузкиВСистему = Объект.ДатаФайлов;
	КонецЕсли;
	
	ЭтаФорма.Расхождения = "<html><head><style> body {background:#FFFBF0} </style></head><body></body></html>";
	
	Элементы.ГруппаРеквизитыТекстФайла.Видимость = Ложь;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		
		ЭтаФорма.Элементы.ПолучитьДанные.Доступность = Ложь;
		ЭтаФорма.Элементы.Загрузить.Доступность = Ложь;

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт поручений доступен для УК Регион ЭсМ.",,, "Объект.Организация");	
		
	КонецЕсли;
	
	ЗаполнитьВариантыДатЗагрузки();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПорученияНаСервере()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	СформироватьКолонкиТаблицы = Истина;
	
	Для Каждого СтрокаТаблицыИсточник Из ЭтаФорма.ТаблицаПоручений Цикл
		
		Если СформироватьКолонкиТаблицы Тогда
						
			Для Каждого Свойство Из СтрокаТаблицыИсточник.ДанныеФайла Цикл
				
				ТаблицаДанных.Колонки.Добавить(Свойство.Ключ);
								
			КонецЦикла;
			
			СформироватьКолонкиТаблицы = Ложь;

		КонецЕсли;
			
		Если СтрокаТаблицыИсточник.ФлагИмпортировать = Истина Тогда
			
			СтрокаТаблицыПриемник = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемник, СтрокаТаблицыИсточник.ДанныеФайла);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ИмпортироватьПорученияФонда(ТаблицаДанных);
		ПолучитьДанныеНаСервере();
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для загрузки!");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	Если Объект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт поручений доступен для УК Регион ЭсМ. Команда отклонена.",,, "Объект.Организация");
		Возврат;	
	КонецЕсли;
	
	ЭтаФорма.ТаблицаПоручений.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
	ТаблицаДанных = ОбработкаОбъект.ПолучитьДанныеФайлов();

	ОбработкаОбъект.ОповеститьОбОшибках(Неопределено);
	
	Если ТаблицаДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		НоваяСтрокаТаблицыНаФорме = ЭтаФорма.ТаблицаПоручений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыНаФорме, СтрокаТаблицыДанных);		
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого КолонкаТаблицы Из ТаблицаДанных.Колонки Цикл
			
			СтруктураДанных.Вставить(КолонкаТаблицы.Имя, СтрокаТаблицыДанных[КолонкаТаблицы.Имя])
			
		КонецЦикла;
		
		НоваяСтрокаТаблицыНаФорме.ДанныеФайла = СтруктураДанных;
		
	КонецЦикла;
	
	ЭтаФорма.ТаблицаПоручений.Сортировать("НомерВходящегоДокумента Возр");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВариантыДатЗагрузкиВСистему(ДатаФайлов)
	
	ТекДата = НачалоДня(ТекущаяДатаСеанса()); 
	
	Если ДатаФайлов > ТекДата Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата файлов " + Формат(ДатаФайлов, "ДФ=dd.MM.yyyy") + " не может быть раньше текущего дня",,,"Объект.ДатаФайлов");
		ДатаФайлов = ТекДата;	
	КонецЕсли;

	МассивВариантовДатЗагрузки = Новый Массив;
	МассивВариантовДатЗагрузки.Добавить(ДатаФайлов); 
	
	//поручения загружаются либо день в день, либо на следующий день.
	//дата файлов + 1 рабочий день
	Если ДатаФайлов < НачалоДня(ТекущаяДатаСеанса()) Тогда

		ДатаТПлюсОдин = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ДатаФайлов, 2); 
		МассивВариантовДатЗагрузки.Добавить(ДатаТПлюсОдин);
	
	КонецЕсли;

	Возврат МассивВариантовДатЗагрузки; 
		
КонецФункции

&НаКлиенте
Процедура СоздатьПоручения(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		СоздатьПорученияНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяКаталогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ДиалогВыбораКаталога                    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.ИмяКаталога;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок	        = "Выберите папку с файлами";
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.ИмяКаталога = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ИмяКаталога = Неопределено Или Объект.ИмяКаталога = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите путь к папке с файлами",,,"Объект.ИмяКаталога");
		Возврат;
	КонецЕсли;
	
	ПапкаСФайлами = Новый Файл(Объект.ИмяКаталога);
	
	Если ПапкаСФайлами.Существует() Тогда
		ЗапуститьПриложение(Объект.ИмяКаталога);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть папку с файлами поручений [" + Объект.ИмяКаталога + "].",,,"Объект.ИмяКаталога");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ПолучитьДанныеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПорученийПередНачаломИзменения(Элемент, Отказ)
	
	ТаблицаПорученийОбработкаНажатия(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПорученийОбработкаНажатия(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не (ТекущиеДанные = Неопределено Или ТекущиеДанные.ДанныеФайла = Неопределено) Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ТаблицаПорученийПоручениеСсылка" Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ПоручениеСсылка) Тогда
				ОткрытьЗначение(ТекущиеДанные.ПоручениеСсылка);
			КонецЕсли;
								
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаПорученийФлагИмпортировать" Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ПоручениеСсылка) И Не ТекущиеДанные.ФлагИмпортировать 
				И Вопрос("Поручение на движение денежных средств уже создано. Поручение будет перезаписано при выполнении команды [СОЗДАТЬ ПОРУЧЕНИЯ].
					   |Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
				
				ТекущиеДанные.ФлагИмпортировать = Ложь;
			Иначе
				ТекущиеДанные.ФлагИмпортировать = Не ТекущиеДанные.ФлагИмпортировать;	
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
		
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьЗначенияФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначенияФлажков(Значение);
	
	Для Каждого СтрокаТаблицы Из ЭтаФорма.ТаблицаПоручений Цикл
		
		Если СтрокаТаблицы.ДанныеФайла <> Неопределено Тогда
			СтрокаТаблицы.ФлагИмпортировать = ?(ЗначениеЗаполнено(СтрокаТаблицы.ПоручениеСсылка), Ложь, Значение);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьЗначенияФлажков(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПорученийПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОтобразитьДанныеФайлаНаФорме", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДанныеФайлаНаФорме()
	
	ЭтаФорма.ФайлТекст.Очистить();
	
	ТекущиеДанные = Элементы.ТаблицаПоручений.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ДанныеФайла = Неопределено Тогда
		ЭтаФорма.Элементы.Расхождения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭтаФорма.Элементы.ФайлТекст.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Возврат;
	КонецЕсли;
	
	НовоеПоручение = Не ЗначениеЗаполнено(ТекущиеДанные.ДанныеФайла.ПоручениеСсылка);
    	
	ЭтаФорма.Элементы.Расхождения.Заголовок = "Поручение № " + ТекущиеДанные.НомерВходящегоДокумента + " (" + ТекущиеДанные.ВидДокумента + ")";
	ЭтаФорма.Элементы.Расхождения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	РасхожденияТекст  = "";
	
	Инд = 1;
	Для Каждого Реквизит Из ТекущиеДанные.ДанныеФайла Цикл
		
		Если Лев(Реквизит.Ключ, 4) = "Тек_" Тогда
			
			ИмяРеквизита = СтрЗаменить(Реквизит.Ключ, "Тек_", ""); 
			
			Если НовоеПоручение Тогда
				
				Если ИмяРеквизита = "КонтрагентДоговорТекстом" И ТекущиеДанные.ДанныеФайла.ПоручениеНаПереводМеждуСчетамиДУ Тогда
	
					РасхожденияТекст = РасхожденияТекст + Символы.ПС 
					                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
					                   + ":</td><td>" + ТекущиеДанные.ДанныеФайла[ИмяРеквизита] 
									   + ", договор ДУ " + ТекущиеДанные.ДанныеФайла.ДДУНомер + " от " 
									   + Формат(ТекущиеДанные.ДанныеФайла.ДДУДата, "ДФ=dd.MM.yyyy") + "</td></tr>";	
					Инд = Инд + 1;
					
				ИначеЕсли ИмяРеквизита = "РасчетныйСчет" И Не ЗначениеЗаполнено(ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) Тогда
						
					Если ТекущиеДанные.ДанныеФайла.ВидДокумента = "Перевод из ДУ в ДУ" И Не ТекущиеДанные.ДанныеФайла.ПоручениеНаПереводМеждуСчетамиДУ Тогда 
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
										   + ":</td><td class=""warning""> НЕОПРЕДЕЛЕН. Не удалось определить расчетный счет контрагента " 
										   + ТекущиеДанные.ДанныеФайла.Отправитель + " .</td></tr>";
					Иначе
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
										   + ":</td><td class=""warning""> НЕОПРЕДЕЛЕН. В файле счет не указан. Если у клиента в исполнителях несколько счетов, после загрузки установите счет вручную.</td></tr>";
										   
					КонецЕсли;
									   
					Инд = Инд + 1;
					
				ИначеЕсли ИмяРеквизита = "ДатаИсполненияС" Тогда
					
					Если НачалоДня(ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) <> НачалоДня(ТекущиеДанные.ДанныеФайла["СрокНачалоФакт"]) Тогда 
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
										   + ":</td><td class=""warning"">" + Формат(ТекущиеДанные.ДанныеФайла[ИмяРеквизита], "ДФ=dd.MM.yyyy") + ". Значение в файле " 
										   + Формат(ТекущиеДанные.ДанныеФайла["СрокНачалоФакт"], "ДФ=dd.MM.yyyy") + "</td></tr>";
					Иначе
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
										   + ":</td><td>" + ?(ТипЗнч(ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) = Тип("Дата"), 
										                      Формат(ТекущиеДанные.ДанныеФайла[ИмяРеквизита], "ДФ=dd.MM.yyyy"), 
															  ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) + "</td></tr>";	
					КонецЕсли;
					
					Инд = Инд + 1;
					
				Иначе
					
					РасхожденияТекст = РасхожденияТекст + Символы.ПС 
					                   + "<tr><td>" + Инд + "</td><td>" + ИмяРеквизита 
									   + ":</td><td>" + ?(ТипЗнч(ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) = Тип("Дата") И ИмяРеквизита <> "ДатаИВремяПолучения", 
									                      Формат(ТекущиеДанные.ДанныеФайла[ИмяРеквизита], "ДФ=dd.MM.yyyy"), 
														  ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) + "</td></tr>";
															
					Инд = Инд + 1;
					
				КонецЕсли;
				
			Иначе
				
				Если ИмяРеквизита = "КонтрагентДоговорТекстом" И ТекущиеДанные.ДанныеФайла.ПоручениеНаПереводМеждуСчетамиДУ Тогда
					
					Если Реквизит.Значение <> ТекущиеДанные.ДанныеФайла[ИмяРеквизита] + ", договор ДУ " + ТекущиеДанные.ДанныеФайла.ДДУНомер + " от " + Формат(ТекущиеДанные.ДанныеФайла.ДДУДата, "ДФ=dd.MM.yyyy") Тогда
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + ". " + ИмяРеквизита 
										   + "</td></tr>" + Символы.ПС + "<tr><td>Текущее значение:</td><td class=""warning"">" 
										   + Реквизит.Значение + "</td>" + Символы.ПС + "</tr><tr><td>Значение в файле:</td><td class=""ok"">" 
										   + ТекущиеДанные.ДанныеФайла[ИмяРеквизита] + ", договор ДУ " + ТекущиеДанные.ДанныеФайла.ДДУНомер 
										   + " от " + Формат(ТекущиеДанные.ДанныеФайла.ДДУДата, "ДФ=dd.MM.yyyy") + "]</td></tr>";	
						Инд = Инд + 1;
						
					КонецЕсли;
					
				ИначеЕсли ИмяРеквизита = "РасчетныйСчет" И ТекущиеДанные.ДанныеФайла.ВидДокумента = "Требование" И Реквизит.Значение <> ТекущиеДанные.ДанныеФайла[ИмяРеквизита] Тогда
					
					РасхожденияТекст = РасхожденияТекст + Символы.ПС 
					                   + "<tr><td>" + Инд + ". " + ИмяРеквизита 
									   + "</td></tr>" + Символы.ПС + "<tr><td>Текущее значение:</td><td class=""warning"">" 
									   + Реквизит.Значение + "</td>" + Символы.ПС + "</tr><tr><td>Значение из настроек учета доходов ЦБ:</td><td class=""ok"">" 
									   + ТекущиеДанные.ДанныеФайла[ИмяРеквизита] + "</td></tr>";
					Инд = Инд + 1; 
					
				ИначеЕсли ИмяРеквизита = "ДатаИсполненияС" Тогда 
					
					Если Реквизит.Значение <> ТекущиеДанные.ДанныеФайла[ИмяРеквизита] Тогда 
						
						Если НачалоДня(ТекущиеДанные.ДанныеФайла[ИмяРеквизита]) <> НачалоДня(ТекущиеДанные.ДанныеФайла["СрокНачалоФакт"]) Тогда
							
							РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                       + "<tr><td>" + Инд + ". " + ИмяРеквизита + "</td></tr>" + Символы.ПС 
											   + "<tr><td>Текущее значение:</td><td class=""warning"">" + Формат(Реквизит.Значение, "ДФ=dd.MM.yyyy") 
											   + "</td></tr><tr><td>Значение в файле:</td><td class=""ok"">" + Формат(ТекущиеДанные.ДанныеФайла["СрокНачалоФакт"], "ДФ=dd.MM.yyyy")
										       + ". Дата загрузки в систему на форме " + Формат(ТекущиеДанные.ДанныеФайла[ИмяРеквизита], "ДФ=dd.MM.yyyy") + "</td></tr>"; 
		
						Иначе
						
						
							РасхожденияТекст = РасхожденияТекст + Символы.ПС 
							                   + "<tr><td>" + Инд + ". " + ИмяРеквизита 
											   + "</td></tr>" + Символы.ПС + "<tr><td>Текущее значение:</td><td class=""warning"">" 
											   + Формат(Реквизит.Значение, "ДФ=dd.MM.yyyy") + "</td>" + Символы.ПС + "</tr><tr><td>Значение в файле:</td><td class=""ok"">" 
											   + Формат(ТекущиеДанные.ДанныеФайла[ИмяРеквизита], "ДФ=dd.MM.yyyy") + "</td></tr>";
						КонецЕсли;
						
						Инд = Инд + 1;
					
					КонецЕсли;
											
				Иначе
						 
					Если Реквизит.Значение <> ТекущиеДанные.ДанныеФайла[ИмяРеквизита] Тогда
						
						РасхожденияТекст = РасхожденияТекст + Символы.ПС 
						                   + "<tr><td>" + Инд + ". " + ИмяРеквизита 
										   + "</td></tr>" + Символы.ПС + "<tr><td>Текущее значение:</td><td class=""warning"">" 
										   + Реквизит.Значение + "</td>" + Символы.ПС + "</tr><tr><td>Значение в файле:</td><td class=""ok"">" 
										   + ТекущиеДанные.ДанныеФайла[ИмяРеквизита] + "</td></tr>";
						Инд = Инд + 1;
						
					КонецЕсли;
					
				КонецЕсли;                                                                
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	 РасхожденияТекст = "<p>" + ?(НовоеПоручение, "НОВОЕ ПОРУЧЕНИЕ", ?(РасхожденияТекст = "", "ПОРУЧЕНИЕ СОЗДАНО В 1С. РАСХОЖДЕНИЙ НЕТ.", "РАСХОЖДЕНИЯ:")) + "</p><table>" + РасхожденияТекст;
	
	 ЭтаФорма.Расхождения =
		"<html>
		|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
		|	<style type=""text/css"">
		|		body  { font: 10pt sans-serif; background: #FFFBF0 }
		|		table { text-align: left; border-spacing: 0; border-collapse: collapse; font-family: ""Arial""; font-size: 14px; }
		|		td    { border: 0px; padding: 3px; }
		|		.warning { color: #DC143C; font-size: 14px; }
		|		.ok      { color: #0000FF; font-size: 14px; }
		|	</style>
		|</head><body>" + РасхожденияТекст + "</table></body></html>";
	
	ЭтаФорма.Элементы.ФайлТекст.Заголовок = ТекущиеДанные.ДанныеФайла.ИмяФайла;
	ЭтаФорма.Элементы.ФайлТекст.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	ЭтаФорма.ФайлТекст.ДобавитьСтроку(ТекущиеДанные.ДанныеФайла.ФайлТекст);
             
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтобразитьДеталиПоручения(Команда)
	
	ЭтаФорма.Элементы.ГруппаРеквизитыТекстФайла.Видимость = Не ЭтаФорма.Элементы.ГруппаРеквизитыТекстФайла.Видимость;
	
	Если ЭтаФорма.Элементы.ГруппаРеквизитыТекстФайла.Видимость Тогда
		Элементы.СкрытьОтобразитьДеталиПоручения.Заголовок = НСтр("ru = 'Скрыть детали'");
	Иначе
		Элементы.СкрытьОтобразитьДеталиПоручения.Заголовок = НСтр("ru = 'Детали поручения'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантДатыЗагрузкиВСистемуПриИзменении(Элемент) 
	
	Для Каждого ТекЗначение Из Элементы.ВариантДатыЗагрузки.СписокВыбора Цикл
		
		Если ТекЗначение.Значение = ЭтаФорма.ВариантДатыЗагрузки Тогда
			Объект.ДатаЗагрузкиВСистему = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ТекЗначение.Представление);		
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТаблицаПоручений Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ПоручениеСсылка) Тогда 
			
			ОчиститьТабличнуюЧасть();
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьВариантыДатЗагрузки()
	
	Элементы.ВариантДатыЗагрузки.СписокВыбора.ЗагрузитьЗначения(ПолучитьВариантыДатЗагрузкиВСистему(Объект.ДатаФайлов));
	
	Для Инд = 0 По Элементы.ВариантДатыЗагрузки.СписокВыбора.Количество() - 1 Цикл 
		
		ТекЗначение = Элементы.ВариантДатыЗагрузки.СписокВыбора[Инд];
		
		ТекЗначение.Представление = Формат(ТекЗначение.Значение, "ДФ=dd.MM.yyyy");
        ТекЗначение.Значение = Инд;
		
	КонецЦикла;
	
	Элементы.ВариантДатыЗагрузки.Доступность = (Элементы.ВариантДатыЗагрузки.СписокВыбора.Количество() > 1);

КонецПроцедуры

&НаКлиенте
Процедура ДатаФайловПриИзменении(Элемент) 
		
	Объект.ДатаЗагрузкиВСистему = Объект.ДатаФайлов;
	
	ЗаполнитьВариантыДатЗагрузки();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьТабличнуюЧасть();	
		
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть()
	
	Если ЭтаФорма.ТаблицаПоручений.Количество() > 0 Тогда
		
		Если Вопрос("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
			ЭтаФорма.ТаблицаПоручений.Очистить();
			ЭтаФорма.Расхождения = "<html><head><style> body {background:#FFFBF0} </style></head><body></body></html>"; 
			
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;	
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры
